run/tutorials/case1_validation_p_and_tauxz/constant/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      materialProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

E              E [ 1 -1 -2 0 0 0 0 ] 2.667e7; // Elastic modulus

nu             nu [ 0 0 0 0 0 0 0 ] 0.3333; //Poisson ratio

k              k [ 0 1 -1 0 0 0 0 ] 0.001; // Permeability

K              K [ 1 -1 -2 0 0 0 0 ] 2e9; // True Bulk modulus

Sr             Sr [ 0 0 0 0 0 0 0 ] .975; // Degree of saturation

p0             p0 [ 1 -1 -2 0 0 0 0 ] 2e5; // Pressure at rest

gamma          gamma [ 1 -2 -2 0 0 0 0 ] 1e4; // Specific weight of water

n              n [ 0 0 0 0 0 0 0 ] 0.3; // Porosity of soil (initial)

planeStress     no;

// ************************************************************************* //
