run/tutorials/case1_validation_p_and_tauxz/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



waveHeight      6;            // in m
waterDepth      20;           // in m
//amplitude       18544.07525;   //wave amplitude
direction	(1 0 0);       //wave direction
period		10.0;          //wave period
waveLength	122.025;       //wave length
phase		.0;            //Phase shift in rad/(2*pi) 
offset		0;	       //base pressure 
value          uniform 0;     //Initial value


// ************************************************************************* //
