run/tutorials/case1_validation_p_and_tauxz/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat raw;

sets
(
    Profile1
		{
			type        uniform;
			axis        z;
			start       (61.0125 0 0);
			end         (61.0125 0 -50);
			nPoints     200;
		}

		Profile2
		{
			type        uniform;
			axis        z;
			start       (30.50625 0 0);
			end         (30.50625 0 -50);
			nPoints     200;
		}


);


fields
(
    p
    tauXZ
);


// ************************************************************************* //
