run/tutorials/case1_validation_p_and_tauxz/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#application="biotFoam"

runApplication blockMesh 
runApplication biotQSFoam  &

